# IsWorkshared Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..IsWorkshared Property
BasicFileInfo Class See Also
---
Checks if the file is workshared.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsWorkshared { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsWorkshared As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsWorkshared {
	bool get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace